Autodesk.Revit.DB.PerformanceAdviser.ExecuteRules(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{System.Int32})
Executes selected rules on a given document.
Remarks:
Disabled rules are not executed.
document:
Document on which the rules will be executed.
rules:
Indices of rules to be executed.
Returns:
Failure messages explaining performance problems detected in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.ExecuteRules(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.PerformanceAdviserRuleId})
Executes selected rules on a given document.
document:
Document on which the rules will be executed.
rules:
Ids of rules to be executed.
Returns:
Failure messages explaining performance problems detected in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012